SNCR_app.controller("defenseAndLaw", function ($scope, $controller, $http, $filter) {



    angular.extend(this, $controller('commonController', {
        $scope: $scope
    }));

    $scope.getNews('defenseAndLaw');

    $scope.items = [
        {
            "description": "ශ්‍රී ලංකා කණ්ඩායමේ ආරම්භක පිතිකරු කුසල් ජනිත් නැවතත් සිය පුහුණුවීම් ආරම්භ කර ඇති ආකාරය දැක්වෙන වීඩියෝවක් ශ්‍රීලංකා ක්‍රිකට් ආයතනය සිය ෆේස් බුක් ගිණුමට එක් කර තිබෙනවා. ICC ය විසින් කුසල් ට එරෙහිව...  <a href=\"http://www.hirunews.lk/sinhala/sports/133153\" target=\"_blank\">Read More</a>",
            "link": "http://www.hirunews.lk/sinhala/sports/133153",
            "title": "තහනම ඉවත් කළ කුසල් නැවතත් පිටියට ආ හැටි"
},
        {
            "description": "ක්‍රීඩා උත්සවයකින් අනතුරුව නාවලපිටිය පොලිසිය විසින් අනුරුද්ධ ජාතික පාසලේ සිසුන් පිරිසකට පහරදීමේ පුවතක් වාර්තා වනවා. අද නාවලපිටිය ජයතිලක ක්‍රීඩාංගනයේ පැවති කලාප ක්‍රීඩා තරඟාවලියෙන් අනතුරුව...  <a href=\"http://www.hirunews.lk/sinhala/133152\" target=\"_blank\">Read More</a>",
            "link": "http://www.hirunews.lk/sinhala/133152",
            "title": "පොලිසිය පාසල් සිසුන් පිරිසකට පහරදුන් හැටි"
},
        {
            "description": "බත්තරමුල්ලේ සිට නෙලුම් පොකුණ දක්වා ඉදිකිරීමට නියමිත ගුවන් පාලමේ සැලසුම සහිත වීඩියෝව මාධ්‍ය වෙත නිකුත් කර තිබෙනවා. මෙය මහනගර සංවර්ධනය ව්‍යාපෘතිය යටතේ එළඹෙන ජුලි මාසයේදී ඉදිකිරීම් ආරම්භ කිරීමට...  <a href=\"http://www.hirunews.lk/sinhala/133151\" target=\"_blank\">Read More</a>",
            "link": "http://www.hirunews.lk/sinhala/133151",
            "title": "වාහන තදබදයට තිත තබමින් රාජගිරියේ ගුවන් පාලම ඉදිවෙන්නේ මෙහෙමයි"
},
        {
            "description": "තමන් කියුබානු සංචාරයක නිරතවීම ඒකාබද්ධ විපක්ෂය සමග ඇති වූ අර්බුදයක ප්‍රතිඵලයක් නොවන බව ප්‍රජාතන්ත්‍රවාදී වාමාංශික පෙරමුණේ නායක පාර්ලිමේන්තු මන්ත්‍රී වාසුදේව නානායක්කාර මහතා පවසනවා. ඔහු...  <a href=\"http://www.hirunews.lk/sinhala/133147\" target=\"_blank\">Read More</a>",
            "link": "http://www.hirunews.lk/sinhala/133147",
            "title": "වාසුදේව කියුබාවේ ගිය ඇත්ත හේතුව මෙන්න"
},
        {
            "description": "පාර්ලිමේන්තුවේ බලය හිතුවක්කාරී ලෙස උදුරානොගෙන බදු සංශෝධන සහ රජයේ ආදායම් මාර්ග අතුරු අය වැයකින් සම්මත කර ගන්නා ලෙස ඒකාබද්ධ විපක්ෂය රජයෙන් ඉල්ලා සිටිනවා. අද පැවති ප්‍රවෘත්ති සාකච්ඡාවකදී ඒකාබද්ධ...  <a href=\"http://www.hirunews.lk/sinhala/133145\" target=\"_blank\">Read More</a>",
            "link": "http://www.hirunews.lk/sinhala/133145",
            "title": "අතුරු අයවැයක් ගෙන එන්න"
},
        {
            "description": "උතුරු පළාත් සභාව නව ව්‍යවස්ථාව සදහා ලබා දුන්නේ රට බෙදීමේ යෝජනා නොවන බව පළාත් ප්‍රධාන අමාත්‍ය සී.වී විග්නේෂ්වරන් මහතා ප්‍රකාශ කරනවා. ප්‍රධාන අමාත්‍යවරයා ඊයේ පස්වරුවේ කොළඹදී පැවති උත්සවයකදී...  <a href=\"http://www.hirunews.lk/sinhala/133143\" target=\"_blank\">Read More</a>",
            "link": "http://www.hirunews.lk/sinhala/133143",
            "title": "උතුරේ යෝජනාව ගෙනා හේතුව"
},
        {
            "description": "යාපනයේදී අතුරුදන් වූ ලලිත් සහ කූගන් රජයේ භාරයේ සිටින බවට තමා ප්‍රකාශ කළේ ආරක්ෂක අමාත්‍යාංශය ලබාදුන් තොරතුරුවලට අනුව බව හිටපු කැබිනට් ප්‍රකාශක, පාර්ලිමේන්තු මන්ත්‍රී කෙහෙලිය රඹුක්වැල්ල සදහන්...  <a href=\"http://www.hirunews.lk/sinhala/133140\" target=\"_blank\">Read More</a>",
            "link": "http://www.hirunews.lk/sinhala/133140",
            "title": "අතුරුදන්වීමක් ගැන කෙහෙළියගෙන් විශේෂ හෙළිදරව්වක්"
},
        {
            "description": "වංචා දූෂණ සිදුකළ පුද්ගලයින්ට එරෙහි පරීක්ෂණ මන්දගාමීව සිදුවීම පිළිබඳව තමා කණගාටුවෙන් සිටින බව මුදල් අමාත්‍ය රවී කරුණානායක ප්‍රකාශ කළා. ජනමාධ්‍යවේදීන්ට යතුරුපැදි ලබාදීමේ උත්සවයකට කොළඹ දී...  <a href=\"http://www.hirunews.lk/sinhala/133139\" target=\"_blank\">Read More</a>",
            "link": "http://www.hirunews.lk/sinhala/133139",
            "title": "මන්දගාමී පරීක්ෂණ ගැන මුදල් ඇමති දුක් වෙයි"
},
        {
            "description": "රාගම විහාර මාවත තේ වත්ත ප්‍රදේශයේදී මාර්ගයේ ගමන් කරමින් සිටි මත්තුමගල මහා විද්‍යාලයේ විදුහල්පතිනියගේ රන් මාලය කඩාගෙන ගොස් තිබෙනවා. ඇය පාසල අවසන්වී නිවෙස බලා පැමිණෙමින් සිටියදීයි යතුරුපැදියකින්...  <a href=\"http://www.hirunews.lk/sinhala/133138\" target=\"_blank\">Read More</a>",
            "link": "http://www.hirunews.lk/sinhala/133138",
            "title": "මහමග තනිව ගිය විදුහල්පතිනියගේ රන් මාල කඩාගත් හැටි මෙන්න  (CCTV දර්ශන සහිතයි)"
},
        {
            "description": "උගන්ඩාවේ විකල්ප රජයේ නායකයා ලෙස දිවුරුම් දීමෙන් අනතුරුව විපක්ෂ නායක කිසා බෙසිෂ්යේ එරට පොලිසිය ඊයේ අත්අඩංගුවට ගත්තා. පෙබරවාරි 18 වැනිදා පැවති ජනාධිපතිවරණයෙන් 60% ක ඡන්ද ප්‍රතිශතයක් ලබාගත්තේ...  <a href=\"http://www.hirunews.lk/sinhala/133137\" target=\"_blank\">Read More</a>",
            "link": "http://www.hirunews.lk/sinhala/133137",
            "title": "උගන්ඩාවේ විකල්ප ජනපති ලෙස දිවුරුම් දී වැඩ වැරදුන හැටි"
},
        {
            "description": "තමන් දෙපාර්තමේන්තුගත කරන ලෙස ඉල්ලමින් උතුරුමැද පළාතේ සෞඛ්‍ය සේවා රියදුරන් ආරම්භ කළ අඛණ්ඩ වැඩවර්ජනය අදත් ක්‍රියාත්මකයි. මෙහිදී එක් සේවකයෙකු අනුරාධපුරයේ පිහිටි උතුරුමැද පළාත් සෞඛ්‍ය සේවා...  <a href=\"http://www.hirunews.lk/sinhala/133136\" target=\"_blank\">Read More</a>",
            "link": "http://www.hirunews.lk/sinhala/133136",
            "title": "සෞඛ්‍ය රියදුරු ගැටළුව අට්ටාලයට නගී"
},
        {
            "description": "අනිද්දා සිට 18 වන දා දක්වා දිවයිනේ සහ අවට මුහුදු ප්‍රදේශවල තද සුළං සහ තද වැසි අපේක්ෂා කරන බව කාලගුණ විද්‍යා දෙපාර්තමේන්තුව ප්‍රකාශ කළා. දිවයින අවට වායුගෝලයේ පවතින කැළඹිලි ස්වභාවය හෙට සිට පීඩන...  <a href=\"http://www.hirunews.lk/sinhala/133135\" target=\"_blank\">Read More</a>",
            "link": "http://www.hirunews.lk/sinhala/133135",
            "title": "අනිද්දා සිට කාලගුණයේ වෙනසක්"
},
        {
            "description": "ලොව විශාලතම භාණ්ඩ ප්‍රවාහන ගුවන් යානය ලෙස සැලකෙන ඇන්ටනෝ 225 වර්ගයේ ම්රියා නැමති ගුවන් යානය මහද්වීප 3 ක් ආවරණය කරමින් දුර්ලභ චාරිකාවක නියැලීමට සූදානම්වනවා. යුක්රේනයේ නිෂ්පාදිත මෙම ගුවන් යානය...  <a href=\"http://www.hirunews.lk/sinhala/133134\" target=\"_blank\">Read More</a>",
            "link": "http://www.hirunews.lk/sinhala/133134",
            "title": "ලොව විශාලතම භාණ්ඩ ප්‍රවාහන ගුවන් යානයේ දුර්ලභ වැඩක් මෙන්න"
},
        {
            "description": "2016 වසරේ පශ්චාත් සීමාවාසික පත්වීම් සඳහා සකස් කළ පුරප්පාඩු ලැයිස්තුව සෞඛ්‍ය අමාත්‍යාංශයේ වෛද්‍ය සේවා අධ්‍යක්ෂවරයා අත්තනෝමතික ලෙස වෙනස් කර ඇති බවට රජයේ වෛද්‍ය නිලධාරීන්ගේ සංගමය චෝදනා කරනවා....  <a href=\"http://www.hirunews.lk/sinhala/133133\" target=\"_blank\">Read More</a>",
            "link": "http://www.hirunews.lk/sinhala/133133",
            "title": "වෛද්‍ය සේවා අධ්‍යක්ෂකට චෝදනාවක්"
},
        {
            "description": "ප්‍රසිද්ද ගායන ශිල්පී ජොලි සීයා සහ ප්‍රසිද්ද නිවේදන ශිල්පී ඩෙන්සිල් නුගේගොඩ අතර සිදුවන වචන හුවමාරුවක් සහිත සමාජ ජාල වල හුවමාරු වන වීඩියෝවක් වෙත මේ දිනවල බොහෝ දෙනෙකුගේ අවධානය යොමු වී තිබෙනවා....  <a href=\"http://www.hirunews.lk/sinhala/entertainment/133131\" target=\"_blank\">Read More</a>",
            "link": "http://www.hirunews.lk/sinhala/entertainment/133131",
            "title": "මයික්‍රෆෝනය උදුරාගත් ජොලි සීයාගෙන් නිවේදකට වාග් ප්‍රහාරයක්"
},
        {
            "description": "බදුල්ල - සොරණාතොට ආදර්ශ ප්‍රාථමික විද්‍යාලයට පානීය ජලය සැපයෙන වැලිහිද ප්‍රජාමූල්‍ය ජල ව්‍යාපෘතියට අසූචි මිශ්‍ර වී තිබෙනවා. විද්‍යාලයේ විදුහල්පතිී බී.ජී සිරිපාල ප්‍රකාශ කරන්නේ ඒ පිළිබද සිදුකළ...  <a href=\"http://www.hirunews.lk/sinhala/133130\" target=\"_blank\">Read More</a>",
            "link": "http://www.hirunews.lk/sinhala/133130",
            "title": "පානීය ජලයට අසුචී මුසුවෙයි"
},
        {
            "description": "දුම්රියක ගැටී මිය ගිය වැලිමුවෙකු මස් කර ආහාරයට ගැනීමට සූදානම් වූ 5 දෙනෙකු තලවකැළේ සෙන්ට්ඇන්ඩි‍්‍රයා වතුයායේදී අත්අඩංගුවට ගෙන තිබෙනවා. ඒ, ඔවුන් පිළිබදව පොලීසියට ලැබුණු තොරතුරක් මතයි. අද දහවල්...  <a href=\"http://www.hirunews.lk/sinhala/133125\" target=\"_blank\">Read More</a>",
            "link": "http://www.hirunews.lk/sinhala/133125",
            "title": "මිය ගිය වැලිමුවෙකු මස් කළ 5 ක් අත්අඩංගුවට (ඡායාරූප)"
},
        {
            "description": "ලාදුරු මර්දනය සඳහා නව ඒකකයක් ස්ථාපිත කරන බව සෞඛ්‍ය අමාත්‍යාංශය ප්‍රකාශ කරනවා. මහජන සෞඛ්‍ය පරීක්ෂකවරුන්ගෙන් සැදුම්ලත් නව ඒකකය දිස්ත්‍රික් මට්ටමින් පිහිටුවන අතර, එංගලන්තයේ ලාදුරු මර්දන වැඩසටහනේ...  <a href=\"http://www.hirunews.lk/sinhala/133124\" target=\"_blank\">Read More</a>",
            "link": "http://www.hirunews.lk/sinhala/133124",
            "title": "ලාදුරු මර්දනයට නව ඒකකයක්"
},
        {
            "description": "පාකිස්ථානයේ - කුවෙටා නගරය කේන්ද්‍ර කොට ගෙන ප්‍රබල භූ කම්පනයක් සිදුව තිබෙනවා. එය රික්ටර් පරිමාණයේ 5 යි දශම 5 ක ප්‍රබල භූ කම්පනයක් බවයි ඇමරිකානු භූ විද්‍යා සමීක්ෂණ ආයතනය ප්‍රකාශ කළේ. භූ කම්පනයෙන්...  <a href=\"http://www.hirunews.lk/sinhala/133123\" target=\"_blank\">Read More</a>",
            "link": "http://www.hirunews.lk/sinhala/133123",
            "title": "පාකිස්ථානයේ භූ කම්පනයක්"
},
        {
            "description": "ලබුගම ජල පවිත්‍රාගාරයේ අත්‍යාවශ්‍ය නවීකරණ කටයුත්තක් හේතුවෙන් කඩුවෙල ප්‍රදේශ කිහිපයකට හෙට පැය 8 ක කාලයක් ජල සැපයුම අත්හිටුවන බව ජාතික ජල සම්පාදන හා ජලාපවහන මණ්ඩලය පවසනවා. ඒ අනුව, හෙට දහවල් 12...  <a href=\"http://www.hirunews.lk/sinhala/133122\" target=\"_blank\">Read More</a>",
            "link": "http://www.hirunews.lk/sinhala/133122",
            "title": "හෙට පැය 8 ක් ජලය කැපේ"
},
        {
            "description": "වත්තල - මාබෝලේ ඇවිදින මංතීරුව කඩාදැමීමේ සිද්ධිය සම්බන්ධයෙන් අත්අඩංගුවට ගෙන සිටි පුද්ගලයින් පස් දෙනා දැඩි ඇප කොන්දේසි මත මුදාහැර තිබෙනවා. ඒ, සැකකරුවන් වත්තල ප්‍රධාන මහේස්ත්‍රාත් පූර්ණිමා පරණගම...  <a href=\"http://www.hirunews.lk/sinhala/133121\" target=\"_blank\">Read More</a>",
            "link": "http://www.hirunews.lk/sinhala/133121",
            "title": "වත්තල මංතීරුව කැඩීමේ සිද්ධියට රක්ෂිත බන්ධනාගාරයේ සිටි 5 දෙනාට ඇප"
},
        {
            "description": "යුද ජයග්‍රහණයේ හත්වන වසර සලකුණු කරමින් රණවිරු විජයග්‍රහණ අභිනන්ද පූජා නමින් සැමරුම් වැඩසටහනක් හිටපු ජනාධිපති මහින්ද රාජපක්ෂගේ ප්‍රධානත්වයෙන් ලබන 18 වනදා කුරුණෑගලදී පැවැත්වෙන බව ඒකාබද්ධ...  <a href=\"http://www.hirunews.lk/sinhala/133114\" target=\"_blank\">Read More</a>",
            "link": "http://www.hirunews.lk/sinhala/133114",
            "title": "ඒකාබද්ධ විපක්ෂයෙන් යුද ජයග්‍රහණ සැමරුමක්"
},
        {
            "description": "ඉන්ධන මිල අඩු කරමින් ජනතාවට ලබාදුන් සහන දැන් ඇතැමුන්ට අමතක වී ඇති බව පාර්ලිමේන්තු ප්‍රතිසංස්කරණ හා ජනමාධ්‍ය අමාත්‍ය ගයන්ත කරුණාතිලක පවසනවා. අමාත්‍යවරයා මේ බව ප්‍රකාශ කළේ මාධ්‍යවේදීන්ට යතුරුපැදි...  <a href=\"http://www.hirunews.lk/sinhala/133113\" target=\"_blank\">Read More</a>",
            "link": "http://www.hirunews.lk/sinhala/133113",
            "title": "ලබාදුන් සහන අමතක වෙලාලු"
},
        {
            "description": "නවක වදය පිළිබද හදිසි සංවාදයක් මතු කර ඇත්තේ රජයේ ශිෂ්‍ය මර්දන ව්‍යාපාරයේ පියවරක් ලෙස බව පෙරටුගාමී සමාජවාදී පක්ෂය පවසනවා. මහනුවර ප්‍රදේශයේ ඊයේ (12) පැවති සම්මන්ත්‍රණයකට එක්වෙමින් එම පක්ෂයේ දේශපාලන...  <a href=\"http://www.hirunews.lk/sinhala/133112\" target=\"_blank\">Read More</a>",
            "link": "http://www.hirunews.lk/sinhala/133112",
            "title": "කරලියට ආ නවක වදය ශිෂ්‍ය මර්දනයේම පියවරක්"
},
        {
            "description": "එංගලන්තයේ පැවති දුෂණ විරෝධී සමුළුවට සහභාගි වූ ජනාධිපති මෛත්‍රීපාල සිරිසේන අද (13) ඉන්දියාවට පැමිණෙනවා. ඒ පසුගිය වසර එකහමාර තුළ ජනාධිපතිවරයා ඉන්දීයාවේ සිදුකරන දෙවන චාරිකාව ලෙසයි. ජනාධිපතිවරයාගේ...  <a href=\"http://www.hirunews.lk/sinhala/133110\" target=\"_blank\">Read More</a>",
            "link": "http://www.hirunews.lk/sinhala/133110",
            "title": "ජනපති ඉන්දියාවට පැමිණෙයි"
}
];



});